In [ ]:
# Install Python Package
%pip install ipython-sql

In [2]:
#Load sql extention
%load_ext sql

In [3]:
#Create SQLite Database
%sql sqlite:///abc-corp.db

In [41]:
%%sql
CREATE TABLE IF NOT EXISTS employees(
    employee_id integer primary key autoincrement,
    first_name varchar(50) not null,
    last_name varchar(50) not null,
    department varchar(50) not null,
    salary decimal(10,2) not null    
);

 * sqlite:///abc-corp.db
Done.

[]

In [11]:
#Check table exists
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///abc-corp.db
Done.

[('employees',), ('sqlite_sequence',)]

In [40]:
#Delete a table
%sql DROP TABLE employees;

 * sqlite:///abc-corp.db
Done.

[]

In [24]:
#Check structure of the table
%sql PRAGMA TABLE_INFO('employees');

 * sqlite:///abc-corp.db
Done.

[(0, 'employee_id', 'INTEGER', 0, None, 1),
 (1, 'first_name', 'varchar(50)', 1, None, 0),
 (2, 'last_name', 'varchar(50)', 1, None, 0),
 (3, 'department', 'varchar(50)', 1, None, 0),
 (4, 'salary', 'decimal(10,2)', 1, None, 0)]

In [42]:
#Adding Columns
%sql ALTER TABLE employees ADD hiring_date DATE;

#Renameing column
%sql ALTER TABLE employees RENAME COLUMN hiring_date TO hire_date;

#Deleting columns
%sql ALTER TABLE employees DROP COLUMN hire_date;

 * sqlite:///abc-corp.db
Done.
 * sqlite:///abc-corp.db
Done.
 * sqlite:///abc-corp.db
Done.

[]

In [45]:
#Altering data
#Inserting data
%sql INSERT INTO employees (employee_id,first_name,last_name,department,salary,performance_rating,hire_date) VALUES(1,'Jason','Zhu','IT',10000,5,'2024-04-30');

%sql INSERT INTO employees (employee_id,first_name,last_name,department,salary,performance_rating,hire_date) VALUES(2,'Lynn','Lin','IT',10000,5,'2024-04-30');

 * sqlite:///abc-corp.db
1 rows affected.
 * sqlite:///abc-corp.db
1 rows affected.

[]

In [43]:
%sql ALTER TABLE employees ADD COLUMN performance_rating INTEGER NULL

%sql ALTER TABLE employees ADD COLUMN hire_date date NULL

 * sqlite:///abc-corp.db
Done.
 * sqlite:///abc-corp.db
Done.

[]

In [44]:
%%sql
INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (6, 'Linda', 'Martinez', 'IT', 70000.00, '2024-04-29', 4);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (7, 'Robert', 'Anderson', 'Finance', 65000.00, '2024-04-30', 3);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (8, 'Patricia', 'Taylor', 'HR', 52000.00, '2024-05-01', 5);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (9, 'Christopher', 'Thomas', 'Marketing', 59000.00, '2024-05-02', 2);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (10, 'Jennifer', 'Lee', 'Sales', 63000.00, '2024-05-03', 3);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (11, 'James', 'White', 'Operations', 56000.00, '2024-05-04', 4);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (12, 'Barbara', 'Harris', 'IT', 68000.00, '2024-05-05', 1);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (13, 'Daniel', 'Clark', 'Finance', 64000.00, '2024-05-06', 5);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (14, 'Nancy', 'Lewis', 'HR', 53000.00, '2024-05-07', 2);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (15, 'Paul', 'Walker', 'Sales', 61000.00, '2024-05-08', 3);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (16, 'Karen', 'Hall', 'Marketing', 60000.00, '2024-05-09', 4);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (17, 'Steven', 'Allen', 'IT', 69000.00, '2024-05-10', 5);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (18, 'Elizabeth', 'Young', 'Finance', 62000.00, '2024-05-11', 2);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (19, 'George', 'King', 'Operations', 57000.00, '2024-05-12', 3);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (20, 'Mary', 'Wright', 'HR', 54000.00, '2024-05-13', 4);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (21, 'Brian', 'Lopez', 'Sales', 62000.00, '2024-05-14', 5);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (22, 'Megan', 'Hill', 'IT', 71000.00, '2024-05-15', 2);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (23, 'Anthony', 'Scott', 'Finance', 66000.00, '2024-05-16', 3);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (24, 'Deborah', 'Green', 'Marketing', 63000.00, '2024-05-17', 4);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (25, 'Larry', 'Adams', 'Operations', 58000.00, '2024-05-18', 5);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (26, 'Sarah', 'Nelson', 'HR', 55000.00, '2024-05-19', 2);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (27, 'Kenneth', 'Carter', 'Sales', 64000.00, '2024-05-20', 3);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (28, 'Betty', 'Mitchell', 'IT', 72000.00, '2024-05-21', 4);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (29, 'Ronald', 'Perez', 'Finance', 67000.00, '2024-05-22', 5);

INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (30, 'Laura', 'Roberts', 'Marketing', 65000.00, '2024-05-23', 2);

 * sqlite:///abc-corp.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [38]:
%sql SELECT * FROM employees

 * sqlite:///abc-corp.db
Done.

[(1, 'Jason', 'Zhu', 'IT', 10000, None, None),
 (2, 'Lynn', 'Lin', 'IT', 10000, None, None),
 (6, 'Linda', 'Martinez', 'IT', 70000, 4, '2024-04-29'),
 (7, 'Robert', 'Anderson', 'Finance', 65000, 3, '2024-04-30'),
 (8, 'Patricia', 'Taylor', 'HR', 52000, 5, '2024-05-01'),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, 2, '2024-05-02'),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, 3, '2024-05-03'),
 (11, 'James', 'White', 'Operations', 56000, 4, '2024-05-04'),
 (12, 'Barbara', 'Harris', 'IT', 68000, 1, '2024-05-05'),
 (13, 'Daniel', 'Clark', 'Finance', 64000, 5, '2024-05-06'),
 (14, 'Nancy', 'Lewis', 'HR', 53000, 2, '2024-05-07'),
 (15, 'Paul', 'Walker', 'Sales', 61000, 3, '2024-05-08'),
 (16, 'Karen', 'Hall', 'Marketing', 60000, 4, '2024-05-09'),
 (17, 'Steven', 'Allen', 'IT', 69000, 5, '2024-05-10'),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, 2, '2024-05-11'),
 (19, 'George', 'King', 'Operations', 57000, 3, '2024-05-12'),
 (20, 'Mary', 'Wright', 'HR', 54000, 4, '2024-05-13'),
 (21, 'Brian', 'Lopez', 'Sales', 62000, 5, '2024-05-14'),
 (22, 'Megan', 'Hill', 'IT', 71000, 2, '2024-05-15'),
 (23, 'Anthony', 'Scott', 'Finance', 66000, 3, '2024-05-16'),
 (24, 'Deborah', 'Green', 'Marketing', 63000, 4, '2024-05-17'),
 (25, 'Larry', 'Adams', 'Operations', 58000, 5, '2024-05-18'),
 (26, 'Sarah', 'Nelson', 'HR', 55000, 2, '2024-05-19'),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, 3, '2024-05-20'),
 (28, 'Betty', 'Mitchell', 'IT', 72000, 4, '2024-05-21'),
 (29, 'Ronald', 'Perez', 'Finance', 67000, 5, '2024-05-22'),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, 2, '2024-05-23')]

In [39]:
%%sql UPDATE employees 
set salary=8000 
WHERE employee_id=1;

 * sqlite:///abc-corp.db
1 rows affected.

[]

In [ ]:
%%sql DELETE FROM employees
WHERE employee_id=30;